import './App.css';

function App() {
  return (
    <div className='App'>
      <header>
        <h1>Добро пожаловать на фан-страницу Чекпукташки!</h1>
      </header>
      <main>
          <section>
              <p>Чекпукташка - это удивительное фэнтэзийное существо, которое живет в волшебном лесу под названием Луминария. Его имя происходит от древнего языка лесных духов и означает "Хранитель света".</p>
        
              <h2>История Чекпукташки</h2>
              <p>Когда-то давно, в самом сердце Луминарии, родился маленький Чекпукташка. С самого рождения он обладал уникальной способностью излучать мягкий свет, который мог исцелять раны и прогонять тьму. Его свет был настолько мощным, что даже самые мрачные уголки леса становились яркими и безопасными.</p>
        
              <p>Чекпукташка рос среди других волшебных существ, таких как эльфы, феи и говорящие животные. Он быстро стал любимцем всех жителей леса благодаря своей доброте и готовности помочь каждому, кто нуждался в его свете. Но однажды, в Луминарии появилась темная сила, которая начала поглощать свет и сеять хаос.</p>
        
              <p>Чекпукташка понял, что его предназначение - защитить Луминарию и её обитателей. Он отправился в опасное путешествие, чтобы найти источник тьмы и уничтожить его. На своем пути он встретил множество испытаний и новых друзей, которые помогали ему в его миссии.</p>
              <p className="highlight-container">
                <span className='highlight'>
                  Но что же ждет Чекпукташку впереди? Сможет ли он победить тьму и вернуть свет в Луминарию? Следите за новыми историями о Чекпукташке, чтобы узнать продолжение его захватывающих приключений!
                </span>
              </p>
          </section>
      </main>
      <footer>
          <p>&copy; 2024 Все права защищены.</p>
      </footer>
    </div>
  );
}

export default App;
